[
  {
    "id": 1,
    "productId": 1,
    "userId": 5,
    "date": "2023-4-11",
    "rating": 0,
    "review": "Dignissim enim quis nec luctus quisque luctus et. Quis quisque magna ut congue luctus nec commodo magna semper ut. Quis faucibus dignissim et quis quis faucibus faucibus luctus sollicitudin. Sollicitudin Dolor congue nec luctus commodo et quisque magna quisque commodo.",
    "likes": 1,
    "dislikes": 0
  },
  {
    "id": 2,
    "productId": 9,
    "userId": 6,
    "date": "2023-4-24",
    "rating": 4,
    "review": "Et congue enim risus magna faucibus quis quis magna faucibus congue sollicitudin. Quis commodo congue semper Dolor massa massa risus. Faucibus nec sollicitudin et faucibus ut faucibus massa congue massa et.",
    "likes": 10,
    "dislikes": 2
  },
  {
    "id": 3,
    "productId": 12,
    "userId": 10,
    "date": "2023-4-20",
    "rating": 4,
    "review": "Ut luctus magna semper luctus congue luctus enim sollicitudin. Quisque faucibus ut massa congue et magna nec ut semper. Sollicitudin sollicitudin Dolor enim risus risus quis faucibus et. Dignissim enim congue nec semper faucibus risus et ut massa.",
    "likes": 12,
    "dislikes": 3
  },
  {
    "id": 4,
    "productId": 12,
    "userId": 6,
    "date": "2023-4-1",
    "rating": 5,
    "review": "Sollicitudin luctus dignissim faucibus Dolor risus commodo nec. Quis enim Dolor ut ut et risus commodo Dolor quis. Faucibus semper quis massa Dolor risus quisque et enim enim sollicitudin.",
    "likes": 12,
    "dislikes": 6
  },
  {
    "id": 5,
    "productId": 11,
    "userId": 3,
    "date": "2023-4-13",
    "rating": 4,
    "review": "Risus quis massa quis quis nec et congue risus commodo nec ut. Luctus massa quisque commodo commodo Dolor sollicitudin dignissim luctus magna quis.",
    "likes": 4,
    "dislikes": 5
  },
  {
    "id": 6,
    "productId": 8,
    "userId": 12,
    "date": "2023-4-3",
    "rating": 1,
    "review": "Faucibus nec Dolor quis ut commodo sollicitudin quis commodo sollicitudin dignissim.",
    "likes": 0,
    "dislikes": 2
  },
  {
    "id": 7,
    "productId": 1,
    "userId": 3,
    "date": "2023-5-12",
    "rating": 4,
    "review": "Faucibus quis quis et sollicitudin Dolor nec quis massa. Luctus Dolor quisque nec quis Dolor sollicitudin enim sollicitudin. Enim Dolor ut magna et luctus luctus enim. Risus Dolor risus Dolor magna Dolor faucibus quis. Magna luctus commodo Dolor commodo enim ut semper Dolor.",
    "likes": 7,
    "dislikes": 1
  },
  {
    "id": 8,
    "productId": 1,
    "userId": 8,
    "date": "2023-4-8",
    "rating": 1,
    "review": "Luctus ut quis sollicitudin et dignissim massa semper Dolor. Quis magna ut et semper dignissim enim massa quis risus enim congue.",
    "likes": 7,
    "dislikes": 3
  },
  {
    "id": 9,
    "productId": 1,
    "userId": 4,
    "date": "2023-5-14",
    "rating": 1,
    "review": "Enim massa nec et quisque semper faucibus ut quis quis. Luctus quis massa luctus dignissim quis quis luctus risus et congue.",
    "likes": 11,
    "dislikes": 0
  },
  {
    "id": 10,
    "productId": 10,
    "userId": 3,
    "date": "2023-5-23",
    "rating": 4,
    "review": "Enim ut ut faucibus sollicitudin faucibus et congue. Magna congue quisque semper risus quis congue luctus semper semper et. Semper et et commodo risus dignissim quisque quis. Nec et congue Dolor ut dignissim nec nec quis. Magna enim quisque risus quis sollicitudin ut dignissim massa.",
    "likes": 11,
    "dislikes": 5
  },
  {
    "id": 11,
    "productId": 10,
    "userId": 7,
    "date": "2023-5-24",
    "rating": 3,
    "review": "Quis massa semper semper faucibus sollicitudin magna massa quisque congue ut quisque. Quis luctus Dolor luctus risus magna congue semper luctus.",
    "likes": 7,
    "dislikes": 2
  },
  {
    "id": 12,
    "productId": 1,
    "userId": 5,
    "date": "2023-5-7",
    "rating": 3,
    "review": "Enim Dolor quis sollicitudin quis massa magna enim et nec magna nec. Congue faucibus quis massa luctus ut quisque luctus.",
    "likes": 4,
    "dislikes": 1
  },
  {
    "id": 13,
    "productId": 4,
    "userId": 2,
    "date": "2023-5-9",
    "rating": 3,
    "review": "Sollicitudin quis semper ut luctus sollicitudin ut magna commodo faucibus quisque sollicitudin. Commodo faucibus semper massa faucibus commodo ut nec et risus enim ut.",
    "likes": 3,
    "dislikes": 3
  },
  {
    "id": 14,
    "productId": 10,
    "userId": 4,
    "date": "2023-5-13",
    "rating": 2,
    "review": "Quisque congue congue faucibus risus luctus enim Dolor Dolor quis Dolor enim. Quisque luctus semper luctus massa Dolor nec faucibus quisque et ut. Nec faucibus enim nec congue semper congue risus quis.",
    "likes": 1,
    "dislikes": 1
  },
  {
    "id": 15,
    "productId": 8,
    "userId": 3,
    "date": "2023-5-15",
    "rating": 1,
    "review": "Quis quisque dignissim et quis quis luctus et ut quis luctus et. Nec congue quis dignissim et enim ut enim semper. Ut faucibus quisque et quisque nec commodo et quis congue massa.",
    "likes": 3,
    "dislikes": 3
  },
  {
    "id": 16,
    "productId": 11,
    "userId": 5,
    "date": "2023-4-25",
    "rating": 0,
    "review": "Faucibus Dolor sollicitudin et commodo et commodo quis faucibus quis. Et nec enim Dolor commodo sollicitudin massa risus magna quisque quisque quis.",
    "likes": 12,
    "dislikes": 2
  },
  {
    "id": 17,
    "productId": 12,
    "userId": 11,
    "date": "2023-5-17",
    "rating": 2,
    "review": "Nec quisque dignissim faucibus dignissim commodo congue Dolor quis dignissim congue. Et magna quis dignissim quis risus quis luctus magna ut nec faucibus. Luctus commodo Dolor semper sollicitudin faucibus enim quis.",
    "likes": 9,
    "dislikes": 4
  },
  {
    "id": 18,
    "productId": 2,
    "userId": 12,
    "date": "2023-5-12",
    "rating": 4,
    "review": "Sollicitudin sollicitudin et massa et quisque Dolor congue. Quis congue semper Dolor dignissim et enim faucibus sollicitudin risus dignissim. Sollicitudin enim quisque nec massa quis magna dignissim dignissim. Dolor quisque dignissim nec luctus massa luctus semper.",
    "likes": 11,
    "dislikes": 4
  },
  {
    "id": 19,
    "productId": 2,
    "userId": 12,
    "date": "2023-5-26",
    "rating": 5,
    "review": "Nec enim ut ut risus risus nec massa sollicitudin nec massa ut. Sollicitudin semper massa enim dignissim semper sollicitudin ut quisque quis.",
    "likes": 11,
    "dislikes": 1
  },
  {
    "id": 20,
    "productId": 10,
    "userId": 4,
    "date": "2023-5-25",
    "rating": 4,
    "review": "Massa quis massa quis enim risus luctus magna dignissim luctus enim. Dolor faucibus enim luctus ut quis quis sollicitudin quisque congue.",
    "likes": 1,
    "dislikes": 0
  },
  {
    "id": 21,
    "productId": 12,
    "userId": 1,
    "date": "2023-5-6",
    "rating": 2,
    "review": "Sollicitudin luctus ut semper congue commodo magna risus congue quis.",
    "likes": 7,
    "dislikes": 6
  },
  {
    "id": 22,
    "productId": 1,
    "userId": 9,
    "date": "2023-4-13",
    "rating": 4,
    "review": "Risus ut nec commodo et congue Dolor quis Dolor quis et. Enim commodo dignissim dignissim et faucibus magna sollicitudin. Nec faucibus nec faucibus et risus quisque massa quis magna luctus sollicitudin.",
    "likes": 10,
    "dislikes": 0
  },
  {
    "id": 23,
    "productId": 5,
    "userId": 8,
    "date": "2023-4-11",
    "rating": 4,
    "review": "Quis magna congue quis et commodo luctus sollicitudin magna enim congue et. Magna luctus nec sollicitudin dignissim semper risus sollicitudin luctus ut Dolor massa.",
    "likes": 3,
    "dislikes": 0
  },
  {
    "id": 24,
    "productId": 1,
    "userId": 2,
    "date": "2023-4-1",
    "rating": 4,
    "review": "Magna faucibus semper quis enim magna ut sollicitudin risus risus ut Dolor. Risus Dolor semper nec enim quisque commodo luctus semper. Faucibus massa congue dignissim congue faucibus congue luctus. Risus nec semper faucibus magna quisque enim faucibus Dolor massa.",
    "likes": 3,
    "dislikes": 4
  },
  {
    "id": 25,
    "productId": 8,
    "userId": 7,
    "date": "2023-5-11",
    "rating": 1,
    "review": "Sollicitudin ut congue risus quis massa dignissim semper semper enim faucibus semper. Congue massa commodo Dolor et dignissim quisque massa. Quis commodo enim congue luctus magna quis faucibus risus commodo magna magna.",
    "likes": 4,
    "dislikes": 5
  },
  {
    "id": 26,
    "productId": 9,
    "userId": 10,
    "date": "2023-4-8",
    "rating": 0,
    "review": "Dolor massa risus quisque sollicitudin sollicitudin risus quis massa. Congue faucibus ut nec quisque quis semper commodo semper sollicitudin massa commodo.",
    "likes": 0,
    "dislikes": 3
  },
  {
    "id": 27,
    "productId": 12,
    "userId": 3,
    "date": "2023-4-18",
    "rating": 1,
    "review": "Faucibus quisque nec ut massa massa luctus commodo quisque et magna. Massa sollicitudin ut sollicitudin luctus commodo quisque semper et. Dolor commodo quis sollicitudin commodo quisque risus quisque.",
    "likes": 12,
    "dislikes": 3
  },
  {
    "id": 28,
    "productId": 7,
    "userId": 12,
    "date": "2023-5-3",
    "rating": 4,
    "review": "Risus semper sollicitudin dignissim quis enim massa ut quis quisque. Quis massa sollicitudin quisque quisque congue Dolor dignissim quis commodo.",
    "likes": 1,
    "dislikes": 6
  },
  {
    "id": 29,
    "productId": 6,
    "userId": 1,
    "date": "2023-5-2",
    "rating": 5,
    "review": "Nec ut semper nec sollicitudin et dignissim risus commodo nec luctus. Luctus Dolor faucibus dignissim luctus sollicitudin congue congue commodo congue. Luctus enim enim congue commodo dignissim luctus quisque dignissim sollicitudin congue.",
    "likes": 6,
    "dislikes": 5
  },
  {
    "id": 30,
    "productId": 1,
    "userId": 1,
    "date": "2023-5-12",
    "rating": 0,
    "review": "Faucibus nec congue faucibus nec nec et luctus risus. Dignissim luctus quis ut semper magna enim sollicitudin et.",
    "likes": 5,
    "dislikes": 5
  },
  {
    "id": 31,
    "productId": 9,
    "userId": 1,
    "date": "2023-4-11",
    "rating": 3,
    "review": "Faucibus et quis magna semper massa dignissim sollicitudin quis dignissim. Sollicitudin nec semper magna quis luctus faucibus ut congue et dignissim. Quis magna dignissim dignissim enim et magna semper faucibus. Enim et enim quis commodo faucibus semper quis quis risus ut.",
    "likes": 7,
    "dislikes": 4
  },
  {
    "id": 32,
    "productId": 2,
    "userId": 1,
    "date": "2023-5-15",
    "rating": 4,
    "review": "Enim Dolor massa enim massa risus congue nec ut luctus. Dignissim enim faucibus semper quis dignissim magna ut faucibus congue commodo. Semper enim commodo nec sollicitudin et nec ut nec ut Dolor Dolor.",
    "likes": 7,
    "dislikes": 3
  },
  {
    "id": 33,
    "productId": 12,
    "userId": 12,
    "date": "2023-5-6",
    "rating": 0,
    "review": "Magna commodo quis quisque faucibus congue et quisque nec nec enim quis. Quis quis massa nec ut faucibus semper faucibus. Quisque massa nec risus quis luctus enim quis. Congue quisque faucibus congue dignissim dignissim congue magna et quisque nec.",
    "likes": 3,
    "dislikes": 6
  },
  {
    "id": 34,
    "productId": 7,
    "userId": 10,
    "date": "2023-5-18",
    "rating": 4,
    "review": "Quisque nec magna commodo quis enim magna dignissim ut. Commodo magna luctus sollicitudin quis massa faucibus nec quis quis sollicitudin.",
    "likes": 12,
    "dislikes": 6
  },
  {
    "id": 35,
    "productId": 5,
    "userId": 7,
    "date": "2023-5-12",
    "rating": 5,
    "review": "Quis et faucibus commodo Dolor luctus sollicitudin commodo faucibus et quis Dolor. Faucibus enim commodo congue et ut magna et ut nec semper risus.",
    "likes": 2,
    "dislikes": 1
  },
  {
    "id": 36,
    "productId": 4,
    "userId": 7,
    "date": "2023-4-9",
    "rating": 2,
    "review": "Dignissim faucibus quis dignissim semper massa nec massa Dolor dignissim et. Dolor enim ut congue et commodo faucibus Dolor magna magna luctus quis. Enim risus ut enim massa massa quis Dolor semper.",
    "likes": 8,
    "dislikes": 2
  },
  {
    "id": 37,
    "productId": 1,
    "userId": 4,
    "date": "2023-5-3",
    "rating": 4,
    "review": "Faucibus magna enim nec massa commodo luctus nec quis quis ut. Semper commodo massa et magna enim et dignissim enim faucibus congue. Commodo quisque faucibus sollicitudin quis dignissim massa sollicitudin.",
    "likes": 4,
    "dislikes": 2
  },
  {
    "id": 38,
    "productId": 3,
    "userId": 2,
    "date": "2023-4-2",
    "rating": 5,
    "review": "Ut faucibus ut faucibus congue congue semper massa nec quis. Dolor quis massa faucibus semper commodo dignissim magna faucibus congue. Sollicitudin quisque et semper luctus nec magna ut ut quis commodo.",
    "likes": 2,
    "dislikes": 3
  },
  {
    "id": 39,
    "productId": 4,
    "userId": 5,
    "date": "2023-4-27",
    "rating": 5,
    "review": "Quis semper ut massa ut quisque Dolor massa. Ut luctus semper quis dignissim et enim ut. Dignissim et luctus risus et quis massa risus.",
    "likes": 0,
    "dislikes": 1
  },
  {
    "id": 40,
    "productId": 4,
    "userId": 4,
    "date": "2023-5-28",
    "rating": 5,
    "review": "Sollicitudin Dolor risus nec et risus nec dignissim et sollicitudin. Nec et et quisque risus congue massa magna commodo ut. Enim commodo enim massa massa et quis ut dignissim.",
    "likes": 7,
    "dislikes": 4
  },
  {
    "id": 41,
    "productId": 11,
    "userId": 7,
    "date": "2023-5-23",
    "rating": 0,
    "review": "Quis dignissim ut congue risus commodo sollicitudin et nec. Congue luctus luctus quisque sollicitudin nec enim luctus dignissim quis massa. Quisque congue semper faucibus magna luctus risus quis quisque sollicitudin et et. Massa commodo enim massa nec risus congue quis massa congue risus.",
    "likes": 3,
    "dislikes": 5
  },
  {
    "id": 42,
    "productId": 2,
    "userId": 7,
    "date": "2023-5-6",
    "rating": 4,
    "review": "Quisque et sollicitudin quisque Dolor magna risus congue. Dignissim faucibus et Dolor et enim nec Dolor ut quisque commodo.",
    "likes": 3,
    "dislikes": 1
  },
  {
    "id": 43,
    "productId": 10,
    "userId": 4,
    "date": "2023-4-23",
    "rating": 4,
    "review": "Quisque faucibus magna semper massa risus ut congue quis. Ut sollicitudin Dolor massa commodo et Dolor massa. Congue quis luctus magna ut quis risus faucibus nec enim enim ut. Magna dignissim commodo commodo enim sollicitudin quis massa.",
    "likes": 2,
    "dislikes": 0
  },
  {
    "id": 44,
    "productId": 9,
    "userId": 7,
    "date": "2023-5-12",
    "rating": 3,
    "review": "Nec quisque dignissim ut faucibus enim ut quis ut. Ut semper ut Dolor Dolor quis ut commodo quis luctus risus. Massa faucibus faucibus massa faucibus ut ut congue dignissim luctus faucibus.",
    "likes": 8,
    "dislikes": 5
  },
  {
    "id": 45,
    "productId": 9,
    "userId": 9,
    "date": "2023-5-22",
    "rating": 4,
    "review": "Quis commodo ut semper risus luctus nec et enim. Massa enim risus et risus quis commodo et faucibus luctus quisque.",
    "likes": 4,
    "dislikes": 4
  },
  {
    "id": 46,
    "productId": 9,
    "userId": 11,
    "date": "2023-5-12",
    "rating": 0,
    "review": "Massa enim semper et sollicitudin commodo ut sollicitudin faucibus nec sollicitudin. Dolor magna ut congue commodo sollicitudin et Dolor magna enim enim dignissim.",
    "likes": 12,
    "dislikes": 2
  },
  {
    "id": 47,
    "productId": 8,
    "userId": 3,
    "date": "2023-4-15",
    "rating": 2,
    "review": "Quis enim nec congue quis magna Dolor luctus quis nec. Commodo luctus congue risus congue congue sollicitudin risus. Semper faucibus ut Dolor luctus et quisque quis. Massa massa semper magna quis enim quisque semper commodo. Nec quisque quis sollicitudin quisque quis quis risus.",
    "likes": 0,
    "dislikes": 6
  },
  {
    "id": 48,
    "productId": 3,
    "userId": 5,
    "date": "2023-5-4",
    "rating": 1,
    "review": "Enim massa commodo dignissim quis quisque congue commodo quis risus luctus. Congue congue enim semper ut massa magna ut. Dolor massa luctus quisque dignissim massa commodo dignissim.",
    "likes": 8,
    "dislikes": 0
  },
  {
    "id": 49,
    "productId": 5,
    "userId": 4,
    "date": "2023-5-13",
    "rating": 4,
    "review": "Semper commodo risus faucibus quisque Dolor enim sollicitudin risus nec enim massa.",
    "likes": 0,
    "dislikes": 4
  },
  {
    "id": 50,
    "productId": 4,
    "userId": 4,
    "date": "2023-5-21",
    "rating": 1,
    "review": "Commodo semper nec congue luctus magna risus nec enim. Massa quis quis et quisque ut nec dignissim congue semper quis massa.",
    "likes": 1,
    "dislikes": 5
  },
  {
    "id": 51,
    "productId": 11,
    "userId": 6,
    "date": "2023-4-28",
    "rating": 5,
    "review": "Congue dignissim faucibus commodo Dolor quisque ut ut quis nec. Et quis ut ut quisque congue sollicitudin enim quisque Dolor commodo luctus.",
    "likes": 8,
    "dislikes": 5
  },
  {
    "id": 52,
    "productId": 1,
    "userId": 4,
    "date": "2023-5-18",
    "rating": 1,
    "review": "Sollicitudin congue massa ut quis nec massa massa commodo dignissim et.",
    "likes": 7,
    "dislikes": 6
  },
  {
    "id": 53,
    "productId": 1,
    "userId": 5,
    "date": "2023-4-28",
    "rating": 5,
    "review": "Enim semper semper enim enim quis commodo faucibus sollicitudin luctus. Faucibus quis quis et commodo semper luctus congue. Faucibus sollicitudin commodo commodo quis magna ut enim quis faucibus. Ut commodo quis semper nec quisque sollicitudin luctus quisque quis.",
    "likes": 2,
    "dislikes": 4
  },
  {
    "id": 54,
    "productId": 11,
    "userId": 2,
    "date": "2023-4-2",
    "rating": 5,
    "review": "Et nec Dolor Dolor quis massa nec dignissim. Quisque luctus dignissim nec quis magna quisque enim sollicitudin magna magna Dolor. Ut dignissim nec luctus et et semper enim nec. Quis ut risus Dolor risus Dolor congue nec ut semper congue Dolor.",
    "likes": 5,
    "dislikes": 4
  },
  {
    "id": 55,
    "productId": 7,
    "userId": 3,
    "date": "2023-4-9",
    "rating": 3,
    "review": "Enim quis magna faucibus luctus et sollicitudin luctus ut Dolor nec. Massa commodo faucibus ut nec congue quis congue.",
    "likes": 10,
    "dislikes": 6
  },
  {
    "id": 56,
    "productId": 6,
    "userId": 11,
    "date": "2023-5-26",
    "rating": 4,
    "review": "Commodo commodo quis quis faucibus quis ut sollicitudin enim ut.",
    "likes": 1,
    "dislikes": 6
  },
  {
    "id": 57,
    "productId": 2,
    "userId": 5,
    "date": "2023-4-15",
    "rating": 5,
    "review": "Dolor quis quisque sollicitudin luctus Dolor congue quisque semper faucibus commodo. Magna semper ut dignissim quis sollicitudin massa et.",
    "likes": 9,
    "dislikes": 6
  },
  {
    "id": 58,
    "productId": 11,
    "userId": 12,
    "date": "2023-4-27",
    "rating": 5,
    "review": "Luctus et quisque nec quis semper quisque semper nec. Quis quis semper nec quis enim enim quisque dignissim luctus commodo.",
    "likes": 9,
    "dislikes": 3
  },
  {
    "id": 59,
    "productId": 11,
    "userId": 9,
    "date": "2023-4-22",
    "rating": 5,
    "review": "Faucibus quis commodo ut quisque enim congue ut ut. Ut nec risus commodo magna enim magna risus congue risus et Dolor. Sollicitudin massa ut congue quis ut ut Dolor. Quis quisque dignissim ut commodo magna commodo faucibus.",
    "likes": 1,
    "dislikes": 4
  },
  {
    "id": 60,
    "productId": 10,
    "userId": 10,
    "date": "2023-5-14",
    "rating": 4,
    "review": "Enim nec semper risus risus nec nec luctus massa nec. Risus congue et risus magna dignissim nec faucibus quis quis sollicitudin nec. Magna magna nec nec risus massa luctus nec semper. Sollicitudin faucibus faucibus risus semper risus sollicitudin Dolor.",
    "likes": 2,
    "dislikes": 1
  }
]